app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kkkk1@gmail.com"], ["LIMIT", 1]]
---
  def login
    byebug
    @user = User.find_by_email(params[:email])