app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "otp", "otp_expiration") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
    @user = User.new(user_params)
    @user.generate_otp
    if @user.save