app/jobs/send_otp_job.rb

  def perform(user_id)
    user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]